ERP DEV.WMS/src/DataProcessors/вмс_ПечатьШтрихкодовНоменклатуры/вмс_ПечатьШтрихкодовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ПечатьШтрихкодовНоменклатуры</name>
  <attributes>
    <name>КоличествоЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЭтикетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЭтикетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭтикеток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пачки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Пачка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьШК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP DEV.WMS/src/InformationRegisters/вмс_ШтрихкодыРасширенный/вмс_ШтрихкодыРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ШтрихкодыРасширенный</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/DataProcessors/вмс_ПечатьШтрихкодовНоменклатуры/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Напечатать(Команда)
	
	МассивЭлементов = Новый Массив;
	Для каждого ШК Из Объект.Товары Цикл
		Если ШК.Штрихкод = "" Тогда
			ТекстС = "Штрихкод на номенклатуру : " + ШК.Номенклатура + " не распечатан, т.к. отсутствует в базе";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстС);
			Продолжить;
		КонецЕсли; 
		Если ШК.КоличествоЭтикеток = 1 Тогда
			МассивЭлементов.Добавить(Новый Структура("Штрихкод, Номенклатура, Характеристика, Серия", ШК.Штрихкод,ШК.Номенклатура,ШК.Характеристика,ШК.Серия));	
		Иначе
			Для Счетчик = 1 По ШК.КоличествоЭтикеток Цикл
				МассивЭлементов.Добавить(Новый Структура("Штрихкод, Номенклатура, Характеристика, Серия", ШК.Штрихкод,ШК.Номенклатура,ШК.Характеристика,ШК.Серия));	
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	РазмерыСтр = Новый Структура;
	РазмерыСтр.Вставить("Высота",Объект.ВысотаЭтикетки);
	РазмерыСтр.Вставить("Ширина",Объект.ШиринаЭтикетки);
	
	ДанныеДляПередачи = Новый Структура;
	ДанныеДляПередачи.Вставить("ВысотаЭтикетки", Объект.ВысотаЭтикетки);
	ДанныеДляПередачи.Вставить("КодируемыеЗначения ", МассивЭлементов);
	ДанныеДляПередачи.Вставить("КоличествоКолонок ", 1);
	ДанныеДляПередачи.Вставить("КоличествоСтрок ", 1);
	ДанныеДляПередачи.Вставить("Отладка", Ложь);
	ДанныеДляПередачи.Вставить("Префикс", "");
	ДанныеДляПередачи.Вставить("РазмерШрифта ", Объект.РазмерШрифта);
	ДанныеДляПередачи.Вставить("Размеры ", РазмерыСтр);
	ДанныеДляПередачи.Вставить("Префикс", "");
	ДанныеДляПередачи.Вставить("РежимПечати ", 2);
	ДанныеДляПередачи.Вставить("ТипКода", 99);
	ДанныеДляПередачи.Вставить("ШиринаЭтикетки", Объект.ШиринаЭтикетки);
	
	
	ТабДок = ВывестиШтрихкодСервер(ДанныеДляПередачи);
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать();
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ВывестиШтрихкодСервер(ПараметрыПечати)
	
	пОбъект = РеквизитФормыВЗначение("Объект");
	Возврат пОбъект.ПечатьТонкийКлиент(ПараметрыПечати);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыИШКНаСервере(ВыбранноеЗначение)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ВыбОбъект = ВыбранноеЗначение.ПолучитьОбъект();
		
		НазваниеТЧДока = "Товары";
		Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
			НазваниеТЧДока = "Запасы";	
		КонецЕсли;
		
		МассивРеквизитов = Новый Массив;
		
		Для каждого ТабличнаяЧасть Из ВыбранноеЗначение.Метаданные().ТабличныеЧасти Цикл
			Если СтрНайти(ТабличнаяЧасть.Имя, НазваниеТЧДока) <> 0 ИЛИ
				СтрНайти(ТабличнаяЧасть.Синоним, НазваниеТЧДока) <> 0 Тогда
				НазваниеТЧДока = ТабличнаяЧасть.Имя;
				Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
					Если (СтрНачинаетсяС(Реквизит.Имя, "Номенклатура") И 
						СтрЗаканчиваетсяНа(Реквизит.Имя, "Номенклатура")) ИЛИ 
						(СтрНачинаетсяС(Реквизит.Имя, "Характеристика") И 
						СтрЗаканчиваетсяНа(Реквизит.Имя, "Характеристика")) ИЛИ
						(СтрНачинаетсяС(Реквизит.Имя, "Серия") И 
						СтрЗаканчиваетсяНа(Реквизит.Имя, "Серия")) Тогда
						МассивРеквизитов.Добавить(Реквизит.Имя);	
					КонецЕсли;
				КонецЦикла;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Объект.Товары.Очистить();
		СтрокаРеквизитов = СтрСоединить(МассивРеквизитов, ", ");
		
		Попытка
			ВыбОбъект[НазваниеТЧДока].Свернуть(СтрокаРеквизитов, "Количество");
		Исключение
			ТекстСообщ = "Не удалось обработать табличную часть документа. Выберите другой документ.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщ);
			Возврат;
		КонецПопытки;
		
		Для каждого НоменклатураДока Из ВыбОбъект[НазваниеТЧДока] Цикл
			ОбработатьСтрокуТаблицы(НоменклатураДока.Номенклатура, ВыводитьОдинШтрихкод, НоменклатураДока, МассивРеквизитов);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ЗаполнитьТаблицуНоменклатурыИШКНаСервере(Объект.ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура СопоставитьИЗаполнитьШтрихкодыНоменклатуры(ТабЗнач)
	
	МассивНоменклатуры = ПолучитьШтрихкодыНоменклатурыПоТоварам(ТабЗнач);
	
	Если МассивНоменклатуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Товар Из ТабЗнач Цикл
		Для каждого НайденныйТовар из МассивНоменклатуры Цикл
			Если Товар.Номенклатура = НайденныйТовар.Номенклатура Тогда
				Объект.Товары.Штрихкод = НайденныйТовар.Штрихкод;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Объект.Пачки.Очистить();
	//
	//Для каждого Строка Из МассивНоменклатуры Цикл
	//	
	//	СтрокаТЧ = Объект.Пачки.Добавить();
	//	СтрокаТЧ.Номенклатура 			= Строка.Номенклатура; 
	//	СтрокаТЧ.Штрихкод				= Строка.Штрихкод; 
	//	
	//	Если ЗначениеЗаполнено(Строка.Штрихкод) Тогда
	//		СтрокаТЧ.ЕстьШК = Истина
	//	КонецЕсли;
	//	
	//	СтрокаТЧ.Количество 			= Строка.Количество;
	//	
	//КонецЦикла; 
	
	//Для каждого Товар Из Объект.Товары Цикл
	//	
	//	НайденныйТовар = Объект.Пачки.НайтиСтроки(Новый Структура("Номенклатура", Товар.Номенклатура));
	//	
	//	Если НайденныйТовар.Количество() = 0 Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Номенклатура " + Товар.Номенклатура + " не имеет штрихкода и не попадет на печать!");
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьШтрихкодыНоменклатурыПоТоварам(ТаблицаТоваров)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаТоваров);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
	|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод,
	|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
	|	вмс_ШтрихкодыРасширенный.Упаковка КАК Упаковка,
	|	вмс_ШтрихкодыРасширенный.Серия КАК Серия
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
	|ГДЕ
	|	вмс_ШтрихкодыРасширенный.Номенклатура В(&СписокНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	NULL
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура В(&СписокНоменклатуры)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	МассивДанных = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		
		Если МассивДанных.Количество() > 0 Тогда
			ШКНайден = НайтиТоварВМассивеСтруктур(Выборка.Номенклатура, МассивДанных, "Номенклатура");
		Иначе
			СД = Новый Структура();
			СД.Вставить("Номенклатура", Выборка.Номенклатура);
			СД.Вставить("Штрихкод", Выборка.Штрихкод);
			СД.Вставить("КоличествоЭтикеток", 0);
			МассивДанных.Добавить(СД); 
		КонецЕсли;
		
		Если ШКНайден = 0 Тогда
			СД = Новый Структура();
			СД.Вставить("Номенклатура", Выборка.Номенклатура);
			СД.Вставить("Штрихкод", Выборка.Штрихкод);
			СД.Вставить("КоличествоЭтикеток", 0);
			МассивДанных.Добавить(СД);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции  

&НаСервере
Функция НайтиТоварВМассивеСтруктур(Номенклатура, МассивДанных, КлючСтруктуры)
	
	Для каждого ЭлементМассива Из МассивДанных Цикл
		Для каждого ЭлементСтуктуры Из ЭлементМассива Цикл
			Если ЭлементСтуктуры.Ключ = КлючСтруктуры
				И ЭлементСтуктуры.Значение = Номенклатура Тогда
				Результат = 1;
				Прервать;
			Иначе
				Результат = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Истина);
	
	ОО = Новый ОписаниеОповещения("ВыбраннаяНоменклатураДляТаблицы",ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, ,,, ОО);
	//ОткрытьФорму("ВнешняяОбработка.ТУ_ПечатьШтрихкодовНоменклатуры.Форма.ФормаПодбораНом",ПараметрыФормы,ЭтаФорма,,,,ОО);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураДляТаблицы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьТаблицуВыбраннойНоменклатуры(РезультатЗакрытия, ВыводитьОдинШтрихкод);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВыбраннойНоменклатуры(Массив, ВыводитьОдинШтрихкод)
	
	Если Массив = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Для каждого Элемент Из Массив Цикл
		
		ОбработатьСтрокуТаблицы(Элемент, ВыводитьОдинШтрихкод);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТаблицы(Номенклатура, ВыводитьОдинШтрихкод, СтрокаТаблицы = Неопределено, МассивРеквизитов = Неопределено)
	
	Запрос = Новый Запрос;
	
	Характеристика = Неопределено;
	Серия = Неопределено;
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", Серия);
	
	Если ЗначениеЗаполнено(СтрокаТаблицы) И СтрокаТаблицы <> Неопределено Тогда
		
		ПараметрыПоиска = Новый Структура;
		Для каждого Реквизит Из МассивРеквизитов Цикл
			ПараметрыПоиска.Вставить(Реквизит, СтрокаТаблицы[Реквизит]);		
		КонецЦикла;
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Данный товар уже был добавлен в список.");
			Возврат;		
		КонецЕсли;
		
		Для каждого Параметр Из МассивРеквизитов Цикл
			Запрос.УстановитьПараметр(Параметр, СтрокаТаблицы[Параметр]);		
		КонецЦикла;
		
	Иначе
		
		ПараметрыПоиска = Новый Структура("Номенклатура", Номенклатура);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Данный товар уже был добавлен в список.");
			Возврат;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		
		Если ВыводитьОдинШтрихкод Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
			|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод
			|ПОМЕСТИТЬ ВТ_ВсеШтрихкодыНоменклатуры
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
			|	ШтрихкодыНоменклатуры.Штрихкод
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ШтрихкодыНоменклатуры.Характеристика = &Характеристика
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВТ_ВсеШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВТ_ВсеШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ВТ_ВсеШтрихкодыНоменклатуры.Серия КАК Серия,
			|	МАКСИМУМ(ВТ_ВсеШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
			|ИЗ
			|	ВТ_ВсеШтрихкодыНоменклатуры КАК ВТ_ВсеШтрихкодыНоменклатуры
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ВсеШтрихкодыНоменклатуры.Номенклатура,
			|	ВТ_ВсеШтрихкодыНоменклатуры.Характеристика,
			|	ВТ_ВсеШтрихкодыНоменклатуры.Серия";
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
			|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
			|	ШтрихкодыНоменклатуры.Штрихкод
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|		КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|		ИНАЧЕ ШтрихкодыНоменклатуры.Характеристика = &Характеристика
			|	КОНЕЦ";	
			
		КонецЕсли;
		
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		Если ВыводитьОдинШтрихкод Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ШтрихкодыНоменклатуры.Партия КАК Серия,
			|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
			|ПОМЕСТИТЬ ВТ_Штрихкоды
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ШтрихкодыНоменклатуры.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ШтрихкодыНоменклатуры.Партия = &Серия
			|		КОНЕЦ
			
			|СГРУППИРОВАТЬ ПО
			|	ШтрихкодыНоменклатуры.Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика,
			|	ШтрихкодыНоменклатуры.Партия
			
			|ОБЪЕДИНИТЬ ВСЕ
			
			|ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия,
			|	МАКСИМУМ(вмс_ШтрихкодыРасширенный.Штрихкод)
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			|		КОНЕЦ
			
			|СГРУППИРОВАТЬ ПО
			|	вмс_ШтрихкодыРасширенный.Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия
			|;
			
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВТ_Штрихкоды.Номенклатура КАК Номенклатура,
			|	ВТ_Штрихкоды.Характеристика КАК Характеристика,
			|	ВТ_Штрихкоды.Серия КАК Серия,
			|	МАКСИМУМ(ВТ_Штрихкоды.Штрихкод) КАК Штрихкод
			|ИЗ
			|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
			
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Штрихкоды.Номенклатура,
			|	ВТ_Штрихкоды.Характеристика,
			|	ВТ_Штрихкоды.Серия";
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ШтрихкодыНоменклатуры.Партия КАК Серия,
			|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ШтрихкодыНоменклатуры.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ШтрихкодыНоменклатуры.Партия = &Серия
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия,
			|	вмс_ШтрихкодыРасширенный.Штрихкод
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			| И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			| И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			| КОНЕЦ";
			
		КонецЕсли;		
		
	Иначе
		
		Если ВыводитьОдинШтрихкод Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
			|	МАКСИМУМ(вмс_ШтрихкодыРасширенный.Штрихкод) КАК Штрихкод
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	вмс_ШтрихкодыРасширенный.Серия,
			|	вмс_ШтрихкодыРасширенный.Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика";
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ
			|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Номенклатура,
			|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
			|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
			|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод
			|ИЗ
			|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
			|ГДЕ
			|	вмс_ШтрихкодыРасширенный.Номенклатура = &Номенклатура
			|	И ВЫБОР
			|			КОГДА &Характеристика = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Характеристика = &Характеристика
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Серия = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ вмс_ШтрихкодыРасширенный.Серия = &Серия
			|		КОНЕЦ"; 
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	МинимальноеКолвоДляПечати = 1;
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		НоваяСтрока = Объект.Товары.Добавить();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы) И СтрокаТаблицы <> Неопределено Тогда
			СтрокаРеквизитов = СтрСоединить(МассивРеквизитов, ", ");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, СтрокаРеквизитов);
			НоваяСтрока.КоличествоЭтикеток = СтрокаТаблицы.Количество;
		Иначе
			НоваяСтрока.Номенклатура = Номенклатура; 
			НоваяСтрока.КоличествоЭтикеток = МинимальноеКолвоДляПечати;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы) И СтрокаТаблицы <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, СтрокаРеквизитов);
			НоваяСтрока.КоличествоЭтикеток = СтрокаТаблицы.Количество;			
			НоваяСтрока.Штрихкод = Выборка.Штрихкод;
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Номенклатура, Характеристика, Серия, Штрихкод");
			НоваяСтрока.КоличествоЭтикеток = МинимальноеКолвоДляПечати;				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШК(Команда)
	ЗагрузитьШКНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьШКНаСервере()
	
	ТабЗнач = Объект.Товары.Выгрузить();
	ТабЗнач.Свернуть("Номенклатура", "Количество");
	
	Если ТабЗнач.Количество()<> 0 Тогда
		СопоставитьИЗаполнитьШтрихкодыНоменклатуры(ТабЗнач);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(МассивТоваров)
	
	Если МассивТоваров.Количество()<> 0 Тогда
		Для каждого ТоварМасс Из МассивТоваров Цикл
			СтрТЧ = Объект.Товары.Добавить();
			СтрТЧ.Номенклатура =  ТоварМасс.Номенклатура;
			СтрТЧ.КоличествоЭтикеток   =  ТоварМасс.КоличествоЭтикеток;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("Массив") Тогда
		ОбработкаОповещенияНаСервере(Параметр);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВысотаЭтикетки = 25;
	Объект.ШиринаЭтикетки = 58;
	Объект.РазмерШрифта = 10;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоДляВсейНоменклатуры(Команда)	
	Для каждого Строка Из Объект.Товары Цикл
		Строка.КоличествоЭтикеток = КоличествоДляВсейНоменклатуры;	
	КонецЦикла;
КонецПроцедуры

#Область ГенерацияШтрихкодаНоменклатуры
&НаКлиенте
Процедура Сгенерировать(Команда)
	СгенерироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаСервере()
	
	Префикс = "3";
	Итератор = ПоследнийНомерШтрихкодаПачек() + 1;
	ВсегоСоздано = 0;
	
	НайденныеОбъекты = Объект.Товары.НайтиСтроки(Новый Структура("Штрихкод",""));
	
	Если НайденныеОбъекты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("У всей номенклатуры есть штрихкоды");
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из НайденныеОбъекты Цикл	
		Штрихкод = Префикс + Формат(Итератор, "ЧЦ=11; ЧВН=; ЧГ=");
		Штрихкод = Штрихкод + КонтрольныйСимволEAN(Штрихкод, 13);
		//Штрихкод = Штрихкод + РегистрыСведений.вмс_ШтрихкодыРасширенный.КонтрольныйСимволEAN(Штрихкод, 13);
		Итератор = Итератор + 1;
		СтрокаТЧ.Штрихкод = Штрихкод;
		
		ЗаписьРС = РегистрыСведений.вмс_ШтрихкодыРасширенный.СоздатьМенеджерЗаписи();
		ЗаписьРС.Заполнить(Неопределено);
		ЗаписьРС.Штрихкод 		= Штрихкод;
		ЗаписьРС.Номенклатура 	= СтрокаТЧ.Номенклатура;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
			ЗаписьРС.Характеристика = СтрокаТЧ.Характеристика;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			ЗаписьРС.Серия = СтрокаТЧ.Серия;	
		КонецЕсли;
		
		ЗаписьРС.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоследнийНомерШтрихкодаПачек()
	
	Номер = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 2, 11) КАК ПорядковыйНомер
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""3""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Попытка
			Номер = Число(Выборка.ПорядковыйНомер);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;	
	КонецЕсли; 
	
	Возврат Номер;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНоменклатуруПодГенерацию(Команда)
	
	Для каждого Товар Из Объект.Товары Цикл
		НайденныйТовар = Объект.Пачки.НайтиСтроки(Новый Структура("Номенклатура", Товар.Номенклатура));
		
		Если НайденныйТовар.Количество() = 0 Тогда
			НовыйТ = Объект.Пачки.Добавить();
			НовыйТ.Номенклатура = Товар.Номенклатура;
			НовыйТ.КоличествоЭтикеток = Товар.Количество;
			НовыйТ.Штрихкод = "";
			НовыйТ.ЕстьШК = Ложь;
		КонецЕсли; 	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
